In [1]:
import numpy as np
import pandas as pd

In [2]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [9]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [5]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [10]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [11]:
df1 = pd.DataFrame(np.arange(9.).reshape(3,3), columns=list('bcd'), index=['Olma','Anor','Uzum'])
df2 = pd.DataFrame(np.arange(12.).reshape(4,3), columns=list('abc'), index=['Olma','Anor','Qovun','Anjir'])

In [12]:
df1

        b    c    d
Olma  0.0  1.0  2.0
Anor  3.0  4.0  5.0
Uzum  6.0  7.0  8.0

In [13]:
df2

         a     b     c
Olma   0.0   1.0   2.0
Anor   3.0   4.0   5.0
Qovun  6.0   7.0   8.0
Anjir  9.0  10.0  11.0

In [14]:
df1 + df2

        a    b    c   d
Anjir NaN  NaN  NaN NaN
Anor  NaN  7.0  9.0 NaN
Olma  NaN  1.0  3.0 NaN
Qovun NaN  NaN  NaN NaN
Uzum  NaN  NaN  NaN NaN

In [18]:
df1.add(df2, fill_value=0)

         a     b     c    d
Anjir  9.0  10.0  11.0  NaN
Anor   3.0   7.0   9.0  5.0
Olma   0.0   1.0   3.0  2.0
Qovun  6.0   7.0   8.0  NaN
Uzum   NaN   6.0   7.0  8.0

In [20]:
df1.sub(df2, fill_value=0)

         a     b     c    d
Anjir -9.0 -10.0 -11.0  NaN
Anor  -3.0  -1.0  -1.0  5.0
Olma   0.0  -1.0  -1.0  2.0
Qovun -6.0  -7.0  -8.0  NaN
Uzum   NaN   6.0   7.0  8.0

In [21]:
df1.rsub(df2, fill_value=0)

         a     b     c    d
Anjir  9.0  10.0  11.0  NaN
Anor   3.0   1.0   1.0 -5.0
Olma   0.0   1.0   1.0 -2.0
Qovun  6.0   7.0   8.0  NaN
Uzum   NaN  -6.0  -7.0 -8.0

In [23]:
df1

        b    c    d
Olma  0.0  1.0  2.0
Anor  3.0  4.0  5.0
Uzum  6.0  7.0  8.0

In [24]:
df1.sub(2)

        b    c    d
Olma -2.0 -1.0  0.0
Anor  1.0  2.0  3.0
Uzum  4.0  5.0  6.0

In [25]:
df1.rsub(2)

        b    c    d
Olma  2.0  1.0  0.0
Anor -1.0 -2.0 -3.0
Uzum -4.0 -5.0 -6.0

In [26]:
df = pd.DataFrame(np.arange(1,13.).reshape(3,4), index=list('abc'), columns=['Olma','Anor','Qovun','Anjir'])
df

   Olma  Anor  Qovun  Anjir
a   1.0   2.0    3.0    4.0
b   5.0   6.0    7.0    8.0
c   9.0  10.0   11.0   12.0

In [27]:
obj = pd.Series([1, 1, 2, 2], index=df.columns)
obj

Olma     1
Anor     1
Qovun    2
Anjir    2
dtype: int64

In [28]:
df+obj

   Olma  Anor  Qovun  Anjir
a   2.0   3.0    5.0    6.0
b   6.0   7.0    9.0   10.0
c  10.0  11.0   13.0   14.0

In [29]:
df.add(obj)

   Olma  Anor  Qovun  Anjir
a   2.0   3.0    5.0    6.0
b   6.0   7.0    9.0   10.0
c  10.0  11.0   13.0   14.0

In [30]:
df-obj

   Olma  Anor  Qovun  Anjir
a   0.0   1.0    1.0    2.0
b   4.0   5.0    5.0    6.0
c   8.0   9.0    9.0   10.0

In [31]:
df.sub(obj)

   Olma  Anor  Qovun  Anjir
a   0.0   1.0    1.0    2.0
b   4.0   5.0    5.0    6.0
c   8.0   9.0    9.0   10.0

In [32]:
df.rsub(obj)

   Olma  Anor  Qovun  Anjir
a   0.0  -1.0   -1.0   -2.0
b  -4.0  -5.0   -5.0   -6.0
c  -8.0  -9.0   -9.0  -10.0

In [33]:
obj = pd.Series([2, 3, 1], index = ['Olma', "Uzun", 'Qovun'])
obj

Olma     2
Uzun     3
Qovun    1
dtype: int64

In [35]:
df + obj

   Anjir  Anor  Olma  Qovun  Uzun
a    NaN   NaN   3.0    4.0   NaN
b    NaN   NaN   7.0    8.0   NaN
c    NaN   NaN  11.0   12.0   NaN

In [37]:
df - obj['Olma']

   Olma  Anor  Qovun  Anjir
a  -1.0   0.0    1.0    2.0
b   3.0   4.0    5.0    6.0
c   7.0   8.0    9.0   10.0

In [38]:
df.add(obj['Olma'])

   Olma  Anor  Qovun  Anjir
a   3.0   4.0    5.0    6.0
b   7.0   8.0    9.0   10.0
c  11.0  12.0   13.0   14.0

In [40]:
df = pd.DataFrame(np.random.randn(3,4), index=list('abc'), columns=['Olma','Anor','Qovun','Anjir'])
df

       Olma      Anor     Qovun     Anjir
a -1.058820  0.010502  0.314275  0.367101
b  0.654394  0.087511 -1.212033 -0.177732
c  0.115845  1.369456 -0.533055 -0.052843

In [41]:
np.abs(df)

       Olma      Anor     Qovun     Anjir
a  1.058820  0.010502  0.314275  0.367101
b  0.654394  0.087511  1.212033  0.177732
c  0.115845  1.369456  0.533055  0.052843

In [43]:
np.round(df)

   Olma  Anor  Qovun  Anjir
a  -1.0   0.0    0.0    0.0
b   1.0   0.0   -1.0   -0.0
c   0.0   1.0   -1.0   -0.0

In [44]:
df

       Olma      Anor     Qovun     Anjir
a -1.058820  0.010502  0.314275  0.367101
b  0.654394  0.087511 -1.212033 -0.177732
c  0.115845  1.369456 -0.533055 -0.052843

In [47]:
df.mean()

Olma    -0.096194
Anor     0.489157
Qovun   -0.476937
Anjir    0.045509
dtype: float64